Repository: pbek/QOwnNotes
Catalog: src/libraries/sonnet/po/*/sonnet5_qt.po
Languages: cs

# Sonnet::Loader|dictionary variant
source: -ise suffixes
cs: -ise přípony

# Sonnet::Loader|dictionary variant
source: -ize suffixes
cs: -ize přípony

# Sonnet::Loader|dictionary variant
source: -ise suffixes and with accents
cs: -ise přípony s přízvuky

# Sonnet::Loader|dictionary variant
source: -ise suffixes and without accents
cs: -ise přípony bez přízvuků

# Sonnet::Loader|dictionary variant
source: -ize suffixes and with accents
cs: -ize přípony s přízvuky

# Sonnet::Loader|dictionary variant
source: -ize suffixes and without accents
cs: -ize přípony bez přízvuků

# Sonnet::Loader|dictionary variant
source: large
cs: velký

# Sonnet::Loader|dictionary variant
source: medium
cs: střední

# Sonnet::Loader|dictionary variant
source: small
cs: malý

# Sonnet::Loader|dictionary variant
source: variant 0
cs: varianta 0

# Sonnet::Loader|dictionary variant
source: variant 1
cs: varianta 1

# Sonnet::Loader|dictionary variant
source: variant 2
cs: varianta 2

# Sonnet::Loader|dictionary variant
source: without accents
cs: bez přízvuků

# Sonnet::Loader|dictionary variant
source: with accents
cs: s přízvuky

# Sonnet::Loader|dictionary variant
source: with ye, modern russian
cs: s je, moderní ruština

# Sonnet::Loader|dictionary variant
source: with yeyo, modern and old russian
cs: s jejo, moderní a stará ruština

# Sonnet::Loader|dictionary variant
source: with yo, old russian
cs: s jo, stará ruština

# Sonnet::Loader|dictionary variant
source: extended
cs: rozšířený

# Sonnet::ConfigDialog|
source: Spell Checking Configuration
cs: Nastavení kontroly pravopisu

# SonnetConfigUI|
source: No backend found for spell checking
cs: Pro kontrolu pravopisu nebyla nalezena žádná podpůrná vrstva

# SonnetConfigUI|
source: Default language:
cs: Výchozí jazyk:

# SonnetConfigUI|
source: Choose your preferred languages
cs: Zvolte preferované jazyky

# SonnetConfigUI|
source: Options
cs: Možnosti

# SonnetConfigUI|
source: Enable autodetection of &language
cs: Povolit automatickou detekci &jazyka

# SonnetConfigUI|
source: Enable &background spellchecking
cs: Po&volit kontrolu pravopisu na pozadí

# SonnetConfigUI|
source: &Automatic spell checking enabled by default
cs: &Automatická kontrola pravopisu implicitně zapnuta

# SonnetConfigUI|
source: Skip all &uppercase words
cs: Přeskakovat slova psaná velkými písmen&y

# SonnetConfigUI|
source: S&kip run-together words
cs: Přes&kakovat spojená slova

# SonnetConfigUI|
source: Ignored Words:
cs: Ignorovaná slova:

# SonnetConfigUI|
source: &Add
cs: Přid&at

# SonnetConfigUI|
source: &Remove
cs: Odst&ranit

# Sonnet::Dialog|@title:window
source: Check Spelling
cs: Zkontrolovat pravopis

# Sonnet::Dialog|progress label
source: Spell checking in progress...
cs: Probíhá kontrola pravopisu...

# Sonnet::Dialog|
source: Spell check stopped.
cs: Kontrola pravopisu zastavena.

# Sonnet::Dialog|
source: Spell check canceled.
cs: Kontrola pravopisu zrušena.

# Sonnet::Dialog|
source: Spell check complete.
cs: Kontrola pravopisu dokončena.

# Sonnet::Highlighter|
source: As-you-type spell checking enabled.
cs: Kontrola pravopisu během psaní zapnuta.

# Sonnet::Highlighter|
source: Too many misspelled words. As-you-type spell checking disabled.
cs: Příliš mnoho chybně napsaných slov. Kontrola pravopisu během psaní byla vypnuta.

# Sonnet::Highlighter|
source: As-you-type spell checking disabled.
cs: Kontrola pravopisu během psaní vypnuta.

# SonnetUi|
source: <qt><p>This word was considered to be an "unknown word" because it does not match any entry in the dictionary currently in use. It may also be a word in a foreign language.</p> <p>If the word is not misspelled, you may add it to the dictionary by clicking <b>Add to Dictionary</b>. If you do not want to add the unknown word to the dictionary, but you want to leave it unchanged, click <b>Ignore</b> or <b>Ignore All</b>.</p> <p>However, if the word is misspelled, you can try to find the correct replacement in the list below. If you cannot find a replacement there, you may type it in the text box below, and click <b>Replace</b> or <b>Replace All</b>.</p> </qt>
cs: <qt><p>Toto slovo je považováno za neznámé, protože neodpovídá žádné položce v právě používaném slovníku. Možná je to také slovo v cizím jazyce.</p> <p>Pokud je slovo napsáno správně, můžete je <b>přidat do slovníku</b>. Pokud si jej nepřejete přidávat, ale přejete si jej ponechat nezměněné, stiskněte <b>Ignorovat</b> nebo <b>Ignorovat vše</b>.</p> <p>Pokud je ovšem slovo špatně napsáno, můžete se pokusit pro něj najít vhodnou náhradu v seznamu níže. Pokud náhradu nenajdete, můžete ji stále zapsat do textového políčka níže a zvolit <b>Nahradit</b> nebo <b>Nahradit vše</b>.</p> </qt>

# SonnetUi|
source: Unknown word:
cs: Neznámé slovo:

# SonnetUi|
source: Unknown word
cs: Neznámé slovo

# SonnetUi|
source: <b>misspelled</b>
cs: <b>chybně napsáno</b>

# SonnetUi|
source: <qt> <p>Select the language of the document you are proofing here.</p> </qt>
cs: <qt> <p>Zde vyberte jazyk kontrolovaného dokumentu.</p> </qt>

# SonnetUi|
source: &Language:
cs: &Jazyk:

# SonnetUi|
source: Text excerpt showing the unknown word in its context.
cs: Výňatek z textu ukazující slovo v jeho kontextu.

# SonnetUi|
source: <qt> <p>Here you can see a text excerpt showing the unknown word in its context. If this information is not sufficient to choose the best replacement for the unknown word, you can click on the document you are proofing, read a larger part of the text and then return here to continue proofing.</p> </qt>
cs: <qt> <p>Zde můžete vidět ukázku textu zobrazující neznámé slovo v jeho kontextu. Pokud tato informace není dostatečná pro výběr vhodného slova jako náhrady, můžete kliknout do dokumentu, který kontrolujete, přečíst si větší část a poté vrátit k dokončení kontroly.</p> </qt>

# SonnetUi|
source: ... the <b>misspelled</b> word shown in context ...
cs: ... <b>chybně napsané</b> slovo zobrazené v kontextu ...

# SonnetUi|
source: <qt> <p>The unknown word was detected and considered unknown because it is not included in the dictionary.<br> Click here if you consider the unknown word not to be misspelled, and you want to avoid wrongly detecting it again in the future. If you want to let it remain as is, but not add it to the dictionary, then click <b>Ignore</b> or <b>Ignore All</b> instead.</p> </qt>
cs: <qt> <p>Toto slovo je považováno za neznámé, protože není obsaženo ve slovníku. <br> Klikněte sem, pokud si myslíte, že neznámé slovo není chybně napsáno a vy si jej nepřejete znovu v označovat jako chybné. Pokud si jej přejete ponechat tak, jak je, a nepřidávat do slovníku, klikněte na <b>Ignorovat</b> popř. <b>Ignorovat vše</b>.</p> </qt>

# SonnetUi|
source: << Add to Dictionary
cs: << Přidat do slovníku

# SonnetUi|
source: Suggestion List
cs: Seznam návrhů

# SonnetUi|
source: <qt> <p>If the unknown word is misspelled, you should check if the correction for it is available and if it is, click on it. If none of the words in this list is a good replacement you may type the correct word in the edit box above.</p> <p>To correct this word click <b>Replace</b> if you want to correct only this occurrence or <b>Replace All</b> if you want to correct all occurrences.</p> </qt>
cs: <qt> <p> Pokud je neznámé slovo chybně napsáno, měli byste zkontrolovat, zda je pro něj dostupná oprava a pokud je, kliknout na ni. Pokud žádné ze slov v seznamu není vhodnou náhradou, můžete zapsat správné slovo do vstupního pole výše.</p> <p>K opravě tohoto slova klikněte na <b>Nahradit</b>, pokud si přejete opravit pouze tento výskyt nebo na <b>Nahradit vše</b> pro nahrazení všech výskytů.</p> </qt>

# SonnetUi|
source: <qt> <p>If the unknown word is misspelled, you should type the correction for your misspelled word here or select it from the list below.</p> <p>You can then click <b>Replace</b> if you want to correct only this occurrence of the word or <b>Replace All</b> if you want to correct all occurrences.</p> </qt>
cs: <qt> <p> Pokud je neznámé slovo chybně napsáno, měli byste sem zapsat správné slovo nebo jej vybrat ze seznamu níže.</p> <p>K opravě tohoto slova klikněte na <b>Nahradit</b>, pokud si přejete opravit pouze tento výskyt nebo na <b>Nahradit vše</b> pro nahrazení všech výskytů.</p> </qt>

# SonnetUi|
source: Replace &with:
cs: Na&hradit za:

# SonnetUi|
source: Language Selection
cs: Výběr jazyka

# SonnetUi|
source: S&uggest
cs: Navrhno&ut

# SonnetUi|
source: <qt> <p>Click here to replace this occurrence of the unknown text with the text in the edit box above (to the left).</p> </qt>
cs: <qt> <p>Klikněte sem pro nahrazení tohoto výskytu neznámého slova textem zadaným do vstupního pole nahoře vlevo.</p> </qt>

# SonnetUi|
source: &Replace
cs: Nah&radit

# SonnetUi|
source: <qt> <p>Click here to replace all occurrences of the unknown text with the text in the edit box above (to the left).</p> </qt>
cs: <qt> <p>Klikněte sem pro nahrazení všech výskytů neznámého slova textem zadaným do vstupního pole nahoře vlevo.</p> </qt>

# SonnetUi|
source: R&eplace All
cs: Nahradit vš&e

# SonnetUi|
source: <qt> <p>Click here to let this occurrence of the unknown word remain as is.</p> <p>This action is useful when the word is a name, an acronym, a foreign word or any other unknown word that you want to use but not add to the dictionary.</p> </qt>
cs: <qt> <p>Klikněte sem pro ponechání tohoto výskytu slova tak, jak je.</p> <p>Tato činnost je užitečná, pokud je slovo akronymem, cizím slovem, nebo jiným neznámým slovem, které si nepřejete přidat do slovníku.</p> </qt>

# SonnetUi|
source: &Ignore
cs: &Ignorovat

# SonnetUi|
source: <qt> <p>Click here to let all occurrences of the unknown word remain as they are.</p> <p>This action is useful when the word is a name, an acronym, a foreign word or any other unknown word that you want to use but not add to the dictionary.</p> </qt>
cs: <qt> <p>Klikněte sem pro ponechání všech výskytů slova tak, jak jsou.</p> <p>Tato činnost je užitečná, pokud je slovo akronymem, cizím slovem, nebo jiným neznámým slovem, které si nepřejete přidat do slovníku.</p> </qt>

# SonnetUi|
source: I&gnore All
cs: I&gnorovat všechny

# SonnetUi|
source: Autocorrect
cs: Automatická oprava

# Sonnet::SpellCheckDecorator|
source: No suggestions for %1
cs: Žádné návrhy pro %1

# Sonnet::SpellCheckDecorator|
source: Ignore
cs: Ignorovat

# Sonnet::SpellCheckDecorator|
source: Add to Dictionary
cs: Přidat do slovníku
